app/controllers/order_items_controller.rb

  def create
  	@order = current_order
    @order_item = @order.order_items.new(order_item_params)
    @order.save
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
INSERT INTO "order_items" ("quantity", "product_id", "order_id", "unit_price", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["quantity", 1], ["product_id", 1], ["order_id", 1], ["unit_price", "20.99"], ["total_price", "20.99"], ["created_at", "2016-07-17 18:36:13.553751"], ["updated_at", "2016-07-17 18:36:13.553751"]]
INSERT INTO "orders" ("subtotal", "created_at", "updated_at", "order_status_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["subtotal", "20.99"], ["created_at", "2016-07-17 18:36:13.507561"], ["updated_at", "2016-07-17 18:36:13.507561"], ["order_status_id", 1]]

  def update
  	@order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.update_attributes(order_item_params)
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."id" = $2 LIMIT 1  [["order_id", 1], ["id", 3]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "order_items" SET "quantity" = $1, "total_price" = $2, "updated_at" = $3 WHERE "order_items"."id" = $4  [["quantity", 2], ["total_price", "13.76"], ["updated_at", "2016-07-17 18:38:42.641723"], ["id", 3]]

  def destroy
  	@order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.destroy
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1 AND "order_items"."id" = $2 LIMIT 1  [["order_id", 1], ["id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 1]]